React_Module_Scripts/React_Allocation_Group_Get_Put_Delete/Absence_React_api_Test.yml
execution:
#- executor: jmeter
- concurrency: 100
  ramp-up: 100s
  hold-for: 50m
  scenario: Allocation_Group

scenarios:
  Allocation_Group:
    script: Allocation_Group_Apis.jmx

modules:
  console:
    disable: true # disable runtime console reporter

reporting:
#- module: console
- module: passfail
  criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed